{
    "quizSrc": [
{
    "term": "3. Which of the following is a well-written brand value for innovation for a company in the sports business?",
    "definition": "c. Giving R&D the liberty to come up with whichever product they think will be the next big hit"
  },
  {
    "term": "4. One of the criteria for evaluating brand strategies is being relevant. Which of the answers below explains what it means to be relevant?",
    "definition": "d. It means being meaningful to your target customers"
  },
  {
    "term": "5. Read the following phrase and think about our lemonade business. Select whether the statement is an end-benefit, an attribute or neither for our lemonade business: \"Our lemonade makes you feel fresh and energized\"",
    "definition": "C. End-benefit"
  },
  {
    "term": "6. What is brand equity?",
    "definition": "C. It outlines the proof points or what the brand is claiming to credibly deliver on the positioning a. A set of assets (and liabilities) linked to a brand's name and symbol that adds to (or subtracts from) the value provided by a product or service to a firm and/or the firm's customers"
  },
  {
    "term": "7. Which of the below are brand architecture models?",
    "definition": "a. House of brands, hybrid and branded house"
  },
  {
    "term": "8. Which of the below are indicators that you might have a brand architecture issue or opportunity?",
    "definition": "d. All of the above"
  },
  {
    "term": "9. Which one of the options below is the right input to develop your brand architecture?",
    "definition": "b. An understanding of how the customers view & define the category"
  },
  {
    "term": "10. What question does a brand portfolio tackle?",
    "definition": "d.How should I use my brands to achieve top- and bottom-line growth?"
  },
  {
    "term": "11. Read the following situation and decide whether it is a portfolio question or a brand architecture issue: \"You are launching a new low-cost product in a category where you already have a brand in a higher value tier and need to decide which brand to use.\"",
    "definition": "a. Portfolio"
  },
  {
    "term": "12. Which of the answers below is a list of key criteria to evaluate when you FIRST DECIDE to expand your brand internationally?",
    "definition": "d. How fierce is the competition? How long have they been there? What is their presence and what are their customer loyalty levels?"
  },
  {
    "term": "13. In the text below, which phases of the purchase funnel are mentioned?\nWhen searching for information for my next trip, I came across an advertisement of South Africa in a travel magazine. I went online and looked at the different itineraries that I could do in that country. I also read some of the reviews of hotels, attractions, bus and train options. I evaluated other options such as Zimbabwe, Kenya and Tanzania. Finally, I decided on South Africa and made my reservation through a travel agent in that country, who responded promptly to my request.",
    "definition": "a.Awareness, Consideration, Purchase"
  },
  {
    "term": "14. Which one of the below is an example of a touchpoint?",
    "definition": "c. Sales clerk"
  },
  {
    "term": "15. Which of the lists below best captures the different roles that your touchpoints can play in the customer experience?",
    "definition": "a. Branded Differentiators, Signature Icons, Category Redefiners and Guest Expectations"
  },
  {
    "term": "16. What is the first step to define your internal communication and training program?",
    "definition": "d. Understanding who your audience is"
  },
  {
    "term": "17. What is a crucial role to recruit when embedding the brand in your organization?",
    "definition": "d. The Brand Champions (or Ambassadors)"
  },
  {
    "term": "18. What is the most important action to take when launching a brand engagement program?",
    "definition": "a. Have your top management's endorsement"
  },
  {
    "term": "COURSE 2\n\n19. If a 10% price decrease is implemented while maintaining a contribution margin of 20%, what percentage increase in sales volume would be needed to ensure profitability?",
    "definition": "d.90-120%"
  },
  {
    "term": "20. You manage marketing at ACME & Sons. Currently, you sell 4,000 units at 10€ each. Variable costs are 5.50€ per unit, and fixed costs are 15,000€.\nIf you increase the price by 5%, what sales volume drop percentage maintains the same profit? (Assume fixed costs stay constant, and variable costs remain stable.)",
    "definition": "a.3.5%"
  },
  {
    "term": "21. By increasing the price by 5%, unit sales drop by 7%. What is the price elasticity? Is the demand elastic or inelastic?",
    "definition": "b. 1.4"
  },
  {
    "term": "22. A product is being sold at a price of €110. After a price increase to €130, the number of units sold drops from 5,000 units to 4,500 units. What is the price elasticity?",
    "definition": "a. -0.55"
  },
  {
    "term": "23. Imagine a retailer considering a 33-percent-off sale on blenders currently priced at $54. The retailer pays $29 per blender from the manufacturer.\nHow much has the volume to increase for the sale to maintain profits?",
    "definition": "b. 248%"
  },
  {
    "term": "24. Consider a wind turbine manufacturer. Currently, a 1.5 MW wind turbine has a price of $1.7M and $1.3M in variable cost.\nIf the manufacturer considers raising the price by 3%, what would be the allowable volume loss to at least maintain profits?",
    "definition": "a.11% to 12%"
  },
  {
    "term": "25. What is the price elasticity if an increase in price of 10% leads to a unit sales drop of 5%?",
    "definition": "b.-0.5"
  },
  {
    "term": "26. What statement about profit is accurate?",
    "definition": "d. All of the mentioned"
  },
  {
    "term": "27. If a respondent's estimated part-worth for a $100 price point is 50, and for a $500 price point it is 10, what is the exchange rate between utility and price in this example?",
    "definition": "b.10"
  },
  {
    "term": "28. In a BDM procedure, if the random sale price drawn is $150, and a participant's offer price is $200, how much does the participant pay to purchase the product?",
    "definition": "c. $150"
  },
  {
    "term": "29. In a segmented market, if a company wants to maximize revenue by offering different products or services to different customer segments based on their willingness to pay, which of the following pricing strategies should it use?",
    "definition": "c. Price discrimination Charging different prices to different customer segments based on their willingness to pay"
  },
  {
    "term": "30. In a scenario where a company serves four distinct customer segments with different willingness to pay for hotel rooms and theme park entrance, which pricing strategy should the company use to maximize revenue if bundling is not allowed?",
    "definition": "a. Set a single price for both hotel room and theme park to appeal to all customer segments equally"
  },
  {
    "term": "31. If Apple wants to maximize profits for the 4GB iPhone based on an experiment that segmented iPod owners and non-iPod owners, what would be the best pricing strategy?",
    "definition": "b. Set the medium price ($399) to balance pre-order rates between iPod owners and non-owners while ensuring higher margins"
  },
  {
    "term": "32. If a movie theater knows the willingness to pay of three customer segments (A, B, and C) across their first five wisits, how can it maximize revenue?",
    "definition": "c. Charge different prices for each visit based on the highest willingness to pay for that specific visit across the three segments"
  },
  {
    "term": "33. When deciding between launching the Standard or Gold version of a credit card, which factor is most important for determining which product to offer?",
    "definition": "a. The fixed and variable costs associated with each version, along with the market size and willingness to pay in each segment"
  },
  {
    "term": "34. Do consumers tend to use price as a quality indicator more often for products they buy frequently or for products they purchase for the first time?",
    "definition": "a. First time products"
  },
  {
    "term": "35.As the marketing manager responsible for television sets, you currently offer two products in your lineup: one priced at $399 and another at $499. Το stimulate sales of the existing products, what price point would you choose for introducing a new, third television set?",
    "definition": "c. A television set at $699"
  },
  {
    "term": "36. You have just recently been hired as a sales representative and today you will have your first meeting with a client. Your company offers multiple products at different prices - from cheap to expensive. When presenting to the client the overall product portfolio, how to best present the options?",
    "definition": "a. Start at the highest priced item"
  },
  {
    "term": "37. Why do price endings have an impact on consumers' decision-making process?",
    "definition": "a. Due to the level and image effect"
  },
  {
    "term": "38. In line with prospect theory, which option do consumers typically prefer: a $5 discount on a $500 produck or on a $50 product?",
    "definition": "d. $50"
  },
  {
    "term": "COUSE 3\n\n39. Who are the main intermediaries in distribution channels?\n\na. Wholesalers and retailers\n\nb. Consumers and retailers\n\nC. Wholesalers and consumers\n\nd. Retailers and manufacturers",
    "definition": "a. Wholesalers and retailers"
  },
  {
    "term": "40. Which of the following sentences defines a \"Push Strategy\"?",
    "definition": "c. Manufacturer induces intermediaries to carry, promote and sell the product"
  },
  {
    "term": "41. Which of the following is not a key factor in channel management?",
    "definition": "c. Select"
  },
  {
    "term": "42. Which of the following is not a main marketing logistics function?",
    "definition": "b. Financing the merchandise"
  },
  {
    "term": "43. What definition best reflects what a merchant wholesaler does?",
    "definition": "b. Takes title of goods"
  },
  {
    "term": "44. Which of the following is not an obstacle that producers and retailers face in their relationship?",
    "definition": "c. Size - major concentration in order to compete"
  },
  {
    "term": "45. Which of the following aspects influences a channel being shorter?",
    "definition": "a. Complexity of purchase process"
  },
  {
    "term": "46. Which one of the following segmentation criteria can you establish to minimize conflict?",
    "definition": "a. Industry"
  },
  {
    "term": "47. Which is one correct definition when describing Trade Marketing?",
    "definition": "d. It is a strategic alliance"
  },
  {
    "term": "48. Which of the following is NOT a way retailers can improve their promotion performance and increase sheir margins on promotions!",
    "definition": "c. Design a promotion process within the department in charge"
  },
  {
    "term": "49. Which classification of retailers looks at the \"breadth\" and \"depth\" of the assortment?",
    "definition": "a. Variety of assortment of merchandise offere"
  },
  {
    "term": "50. Which Pricing Strategy is the best to implement?",
    "definition": "c. It depends on various factors"
  },
  {
    "term": "51. What main activity do retailers NOT provide?",
    "definition": "d. Keeping bulk"
  },
  {
    "term": "52. What aspects from the consumer experience DOES NOT have a strong impact on brand advocacy?",
    "definition": "b. Price"
  },
  {
    "term": "53. Which is NOT a benefit of Omni-Channel Retailing, especially for the traditional store-based and catalogue retailers when using electronic channels",
    "definition": "a. Becoming a leader"
  },
  {
    "term": "54. Thinking about future retail trends, towards which age are we heading?",
    "definition": "c. Age of the Customer"
  },
  {
    "term": "55. Which of the following is NOT a critical question companies need to address to achieve customer-management excellence in emerging markets?",
    "definition": "b. How we will maintain our strategy?"
  },
  {
    "term": "56. Which of the following can retailers NOT be classified by?",
    "definition": "c. Communication"
  },
  {
    "term": "57. If we talk about entry strategies, which of the following Entry Strategies requires the highest level of investment for the retailer?",
    "definition": "a. Direct Investment"
  },
  {
    "term": "58. Which of the following Golden Rules for a successful Franchise is the most critical?",
    "definition": "d. Select the right Partner"
  },
  {
    "term": "59. refers to the nature of the relationship that customers have with the brand and the extent to which customers feel that they are \"in synch\" with the brand",
    "definition": "b. Brand resonance"
  },
  {
    "term": "COUSE 4\n\n60. Consumers that exhibit a positively biased behavior toward a specific brand are exhibiting:",
    "definition": "a. Brand loyalty"
  },
  {
    "term": "61. is the process of evaluating each consumer segment's attractiveness and selecting one or more segments according to their attractiveness for the company.",
    "definition": "d. Targeting"
  },
  {
    "term": "62. Consumers exhibiting loyalty generally have one or more specific reasons for their purchase decisions and they can easily articulate these reasons.",
    "definition": "a. Head loyalty"
  },
  {
    "term": "63. Please fill in with the concept you feel is more appropriate for the sentence.\nIn order to your communication campaign should aim to evoke a positive emotional response in consumers.",
    "definition": "b. Change behavior"
  },
  {
    "term": "64. I have seen a new version of the headset that I own. Its sound quality is enhanced and it blocks outside noise. It will help me concentrate better while I am working...\nWhich step of the consumer decision making process does this consumer statement corresponds to?",
    "definition": "b. Need recognition"
  },
  {
    "term": "65. Please indicate which of the following is NOT one of the four steps of the Selective Processes Theory:",
    "definition": "c. Selective Adaptation"
  },
  {
    "term": "66. Đâu là thứ tự đúng của các bước truyền thông hiệu quả?\na. Thiết kế truyền thông\nb. Xác định đối tượng mục tiêu\nc. Quyết định về phương tiện truyền thông\nd. Xác định mục tiêu truyền thông\ne. Chọn kênh\nf. Đo lường kết quả",
    "definition": "3. b, d, a, e, c, f"
  },
  {
    "term": "67. Please indicate which of the following is NOT ane of the dimensions of the FCB Grid:",
    "definition": "B. Reactive"
  },
  {
    "term": "68. AIDA stands for attention__________, desire and _________",
    "definition": "Interest, action"
  },
  {
    "term": "Quiz 1 Mooc 1\n\nQuestion 1\n\nBased on the information given below, please choose the answer that comes closest to the estimated number of people who go to the movies in the northeastern part of the United States.\n\nThe states included in this region are Connecticut, Delaware, Maine, Maryland, Massachusetts, New Hampshire, New Jersey, New York, Pennsylvania, Rhode Island, and Vermont. This data comes from the 2012 US Census Bureau, which collects information about different aspects of the population.",
    "definition": "42,148 million"
  },
  {
    "term": "Question 2\n\nUsing the different types of product categories that we reviewed, please watch the following video (https://www.youtube.com/watch?v=6pF55yy0H3g&t=1s) and classify the service that Coca-Cola offered with its promotion.",
    "definition": "Emotional, intangible and low involvement"
  },
  {
    "term": "If you had launched the lemonade business we discussed in our lectures in your neighbourhood, which of the following phrases best describes the situation your product may be entering its growth phase?",
    "definition": "Sales are growing rapidly, but so are the number of competitors. You are developing your sales channels to distribute in as many outlets as possible.."
  },
  {
    "term": "Question 4\n\nWhich of the product strategies below did Apple use when they decided to launch iPhone?\n\nHere is a summary on how the Iphone was launched by Steve Jobs in 2007: https://www.history.com/this-day-in-history/steve-jobs-debuts-the-iphone",
    "definition": "Diversification."
  },
  {
    "term": "Imagine that you work for Microsoft and you are doing an analysis of the next step for the Microsoft Windows System within the desktop market. Using the data below, where would you place it within the BCG matrix?",
    "definition": "Cow"
  },
  {
    "term": "Question 6\nWhich of the below is NOT a key success factor when launching a new product?",
    "definition": "Giving R&D the liberty to come up with whichever product they think will be the next big hit."
  },
  {
    "term": "Quiz 2 Mooc 1\n1.\nQuestion 1\nWhat are the key inputs for developing your brand?",
    "definition": "Business strategy, brand image, market trends, customer analysis, competitive analysis."
  },
  {
    "term": "2.\n\nQuestion 2\n\nRead the following phrase and think about our lemonade business. Select whether the statement is an end-benefit, an attribute or neither for our lemonade business: \"Our lemonade makes you feel fresh and energized\"",
    "definition": "End-benefit."
  },
  {
    "term": "Question 3\nIn the following advertising, please identify which one is the \"reason to believe\":",
    "definition": "The curves on the models."
  },
  {
    "term": "Question 4\nWhich of the following is a well-written brand value for innovation for a company in the sports business?",
    "definition": "\"For us, Innovation means enhancing the performance of our customers through the use of technology.\""
  },
  {
    "term": "Question 5\nOne of the criteria for evaluating brand strategies is being relevant. Which of the answers below explains what it means to be relevant?",
    "definition": "It means being meaningful to your target customers."
  },
  {
    "term": "Question 6\n\nRead the following three sentences about FedEx and answer the question in bold:\n\nSentence 1: For businesses of all sizes, Fedex is the solutions and logistics company that provides peace of mind through unparalleled innovation, quality, and consistency.\n\nSentence 2: Business solutions for your peace of mind.\n\nSentence 3: Relax, It’s Fedex.\n\nWhich one of these sentences is the company's positioning statement?",
    "definition": "Sentence 1"
  }
  ]
  }
